app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."end_date" ASC
---
  def index
    @projects = Project.all
    @projects = @projects.order(:end_date)

INSERT INTO "projects" ("title", "description", "goal", "start_date", "end_date", "created_at", "updated_at", "image", "owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    @project[:owner_id] = current_user.id
    if @project.save